codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/SW4STM32/STM32746G_DISCOVERY/Example/User/gui.c
#include <stdlib.h>
#include <stdio.h>
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"
#include "gui/gui.h"
#include "ex03/macros.h"
#include "main.h"
#include "string.h"
#include "gui/leds.h"
#include "gui/whaondas.h"
#include "gui/perilla35x35x25.h"
#include "gui/perilla42x41x25.h"
#include "gui/perilla52x52x25.h"
#include "gui/Spritesheet_slider.h"
//#include "gui/slider5pos.h"
#include "gui/prototipos.h"
//#include "gui/tremoloondas.h"
//#include "gui/vibratoondas.h"

#define DELAY 0
#define OCTAVADOR 1
#define CHORUS 2
#define PHASER 3
#define WHA 4
#define REVERB 5
#define DISTORSION 6
#define FLANGER 7
#define TREMOLO 8
#define VIBRATO 9
#define EQ 10
#define RINGMOD 11
#define IZQUIERDA 0
#define MENU_1 14
#define MENU_2 15
#define DERECHA 1
#define HOME 2
#define IZQUIERDA_MENU 16
#define DERECHA_MENU 17

#define PERILLA 0
#define SLIDER 1
// private functions

extern int seleccion_pedal, seleccion_menu;
extern int pedal_individual;
extern PedalElement *Pedales[12];
extern LinkElementMenu * Flecha_Menu_Izquierda, *Flecha_Menu_Derecha;

static void drawElementLabel(GUIElement *e);

static DMA2D_HandleTypeDef hDma2dHandler;

// externally defined structures & functions

extern LTDC_HandleTypeDef hLtdcHandler;
static void LL_ConvertLineToARGB8888(void *src,void *dst,uint32_t xstride,uint32_t color_mode);

//Varibales Perillas Spritesheet_slider
//static SpriteSheet slider5xpos = { .pixels = slider5pos,
//		.spriteWidth = 10, .spriteHeight = 83, .numSprites = 5, .format =
//				CM_ARGB8888};//CM_RGB888
static SpriteSheet Spritesheet13_slider = { .pixels = Spritesheet_slider,
		.spriteWidth = 34, .spriteHeight = 83, .numSprites = 26, .format =
				CM_ARGB8888};//CM_RGB888
static SpriteSheet perilla4241 = { .pixels = perilla42x41x25,
		.spriteWidth = 42, .spriteHeight = 41, .numSprites = 25, .format =
				CM_ARGB8888};//CM_RGB888
static SpriteSheet perilla5252 = { .pixels = perilla52x52x25,
		.spriteWidth = 52, .spriteHeight = 52, .numSprites = 25, .format =
				CM_ARGB8888};//CM_RGB888
static SpriteSheet perilla3535 = { .pixels = perilla35x35x25,
		.spriteWidth = 35, .spriteHeight = 35, .numSprites = 25, .format =
				CM_ARGB8888};//CM_RGB888
static SpriteSheet whaonda = { .pixels = whaondas,
		.spriteWidth = 41, .spriteHeight = 41, .numSprites = 6, .format =
				CM_ARGB8888};//CM_RGB888
//static SpriteSheet vibratoonda = { .pixels = vibratoondas,
//		.spriteWidth = 35, .spriteHeight = 35, .numSprites = 4, .format =
//				CM_ARGB8888};//CM_RGB888
//static SpriteSheet tremoloonda = { .pixels = tremoloondas,
//		.spriteWidth = 41, .spriteHeight = 41, .numSprites = 4, .format =
//				CM_ARGB8888};//CM_RGB888
//

// push button functions

void renderPushButton(GUIElement *bt) {
	if (bt->state & (GUI_DIRTY|GUI_HOVER)) {
		SpriteSheet *sprite = bt->sprite;
		uint8_t state = bt->state & GUI_ONOFF_MASK;
		uint8_t id = state == GUI_ON ? 1 : 0;
		drawSprite(bt->x, bt->y, id, sprite);
		drawElementLabel(bt);
		// clear dirty flag
		bt->state &= ~((uint16_t) GUI_DIRTY);
	}
}

// dial button functions

void handleDialButton(GUIElement *bt, GUITouchState *touch) {
	//BSP_AUDIO_OUT_Pause();
	int16_t delta=0;
	float newVal=0;
	if (touch->touchDetected) {
		// touch detected...
		uint16_t x = touch->touchX[0];
		uint16_t y = touch->touchY[0];
		DialButtonState *db = (DialButtonState *) bt->userData;
		if (bt->state == GUI_HOVER) {
			//int16_t dx = (x - db->startX);
			//int16_t dy = (y - db->startY);
			//int16_t delta = abs(dx) > abs(dy) ? dx : dy;
			if(db->orientacion==PERILLA){
				delta = (x - db->startX);
				newVal = db->startValue + db->sensitivity * delta;
				db->value = CLAMP(newVal, 0.0f, 1.0f);
			}
			else if(db->orientacion==SLIDER){
				delta = (y - db->startY);
				newVal = db->startValue + (db->sensitivity/2) * delta;
				db->value = CLAMP(newVal, 0.0f, 1.0f);
//				if(Pedales[10]->push->push_state)
//				{
//					db->value = CLAMP(newVal, 0.0f, 0.5f);
//				}
//				else
//				{
//					db->value = CLAMP(newVal, 0.5f, 1.0f);
//				}
			}
			bt->state = GUI_DIRTY | GUI_HOVER;
			if (bt->callback != NULL) {
				bt->callback(bt);
			}
		} else if (x >= bt->x && x < bt->x + bt->width && y >= bt->y
				&& y < bt->y + bt->height) {
			bt->state = GUI_HOVER;
			db->startX = x;
			db->startY = y;
			db->startValue = db->value;
		}
	} else if (bt->state == GUI_HOVER) {
		bt->state = GUI_OFF | GUI_DIRTY;
	}
	//BSP_AUDIO_OUT_Resume();
}

void renderDialButton(GUIElement *bt) {
	uint8_t id=0;
	if (bt->state & GUI_DIRTY) {
		SpriteSheet *sprite = bt->sprite;
		DialButtonState *db = (DialButtonState *) bt->userData;
		if (db->orientacion==SLIDER)
		{
			if (Pedales[10]->push->push_state==GUI_ON)
			{
				id = (uint8_t) (db->value * (float) (11));
			}
			else if(Pedales[10]->push->push_state==GUI_OFF)
			{
				id = (uint8_t) 13+(db->value * (float) (11));
			}
		}
		else
		{
			id = (uint8_t) (db->value * (float) (sprite->numSprites - 1));
		}
		drawSprite(bt->x, bt->y, id, sprite);
		drawElementLabel(bt);
		bt->state &= ~((uint16_t) GUI_DIRTY);
	}
}

// common functionality

static void drawElementLabel(GUIElement *e) {
	if (e->label != NULL) {
		SpriteSheet *sprite = e->sprite;
		BSP_LCD_DisplayStringAt(e->x, e->y + sprite->spriteHeight + 4,
				(uint8_t*) e->label, LEFT_MODE);//
	}
}

static uint8_t colorModeStrides[] = { 4, 3, 2, 2, 2 };

void drawSprite(uint16_t x, uint16_t y, uint8_t id, SpriteSheet *sprite) {
	uint32_t lcdWidth = BSP_LCD_GetXSize();
	uint32_t address = hLtdcHandler.LayerCfg[LTDC_ACTIVE_LAYER].FBStartAdress
			+ (((lcdWidth * y) + x) << 2);
	uint16_t width = sprite->spriteWidth;
	uint16_t height = sprite->spriteHeight;
	uint8_t *pixels = (uint8_t *) sprite->pixels;
	uint32_t stride = colorModeStrides[sprite->format];
	pixels += (id * width * height) * stride;
	stride *= width;
	lcdWidth <<= 2;
	while (--height) {
		LL_ConvertLineToARGB8888(pixels, (uint32_t *) address, width,
				sprite->format);
		address += lcdWidth;
		pixels += stride;
	}
}

void drawBitmapRaw(uint16_t x, uint16_t y, uint16_t width, uint16_t height,
		uint8_t *pixels, uint32_t colorMode, uint8_t active_layer) {
	uint32_t lcdWidth = BSP_LCD_GetXSize();
	uint32_t address = hLtdcHandler.LayerCfg[active_layer].FBStartAdress
			+ (((lcdWidth * y) + x) << 2);//LTDC_ACTIVE_LAYER
	uint16_t stride = width * colorModeStrides[colorMode];
	lcdWidth <<= 2;
	while (--height) {
		LL_ConvertLineToARGB8888(pixels, (uint32_t *) address, width,
				colorMode);
		address += lcdWidth;
		pixels += stride;
	}
}

