codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/SW4STM32/STM32746G_DISCOVERY/Example/User/gui.c
// GUI element constructors

GUIElement *guiElement(uint8_t id, char *label, uint16_t x, uint16_t y,
		SpriteSheet *sprite, GUICallback cb) {
	GUIElement *e = (GUIElement *) calloc(1, sizeof(GUIElement));
	e->id = id;
	e->x = x;
	e->y = y;
	e->width = sprite->spriteWidth;
	e->height = sprite->spriteHeight;
	e->sprite = sprite;
	e->label = label;
	e->callback = cb;
	e->state = GUI_OFF | GUI_DIRTY;
	return e;
}

GUIElement *guiDialButton(uint8_t id, char *label, uint16_t x, uint16_t y,
		float val, float sens, uint8_t orientacion, SpriteSheet *sprite, GUICallback cb) {
	GUIElement *e = guiElement(id, label, x, y, sprite, cb);
	DialButtonState *db = (DialButtonState *) calloc(1,sizeof(DialButtonState));
	e->handler = handleDialButton;
	e->render = renderDialButton;
	e->userData = db;
	db->value = val;
	db->sensitivity = sens;
	db->orientacion = orientacion;
	return e;
}

GUI *initGUI(uint8_t num, sFONT *font, uint32_t bgCol, uint32_t textCol) {
	GUI *gui = (GUI *) calloc(1, sizeof(GUI));
	gui->items = (GUIElement **) calloc(num, sizeof(GUIElement *));
	gui->numItems = num;
	gui->font = font;
	gui->bgColor = bgCol;
	gui->textColor = textCol;
	return gui;
}

void guiForceRedraw(GUI *gui) {
	for (uint8_t i = 0; i < gui->numItems; i++) {
		gui->items[i]->state |= GUI_DIRTY;
	}
}

void guiUpdate(PerillaElement *gui, GUITouchState *touch) {
	for (uint8_t i = 0; i < gui->numItems; i++) {
		GUIElement *e = gui->perillas[i];
		e->handler(e, touch);
		e->render(e);
	}
}

void guiUpdateTouch(TS_StateTypeDef *raw, GUITouchState *touch) {
	touch->touchDetected = raw->touchDetected;
	touch->touchX[0] = raw->touchX[0];
	touch->touchY[0] = raw->touchY[0];
}

static void LL_ConvertLineToARGB8888(void *src,
                                     void *dst,
                                     uint32_t xstride,
                                     uint32_t color_mode) {
  hDma2dHandler.Init.Mode         = DMA2D_M2M_PFC;
  hDma2dHandler.Init.ColorMode    = DMA2D_ARGB8888;
  hDma2dHandler.Init.OutputOffset = 0;

  hDma2dHandler.LayerCfg[1].AlphaMode      = DMA2D_NO_MODIF_ALPHA;//
  hDma2dHandler.LayerCfg[1].InputAlpha     = 0xFF;//FF
  hDma2dHandler.LayerCfg[1].InputColorMode = color_mode;
  hDma2dHandler.LayerCfg[1].InputOffset    = 0;
  hDma2dHandler.Instance                   = DMA2D;

  if (HAL_DMA2D_Init(&hDma2dHandler) == HAL_OK) {
    if (HAL_DMA2D_ConfigLayer(&hDma2dHandler, 1) == HAL_OK) {
      if (HAL_DMA2D_Start(&hDma2dHandler, (uint32_t)src, (uint32_t)dst, xstride,
                          1) == HAL_OK) {
        HAL_DMA2D_PollForTransfer(&hDma2dHandler, 10);
      }
    }
  }
}

//Escritas por nosotros

void linkRequestHandlers_pedal_individual(PedalElement *bt, GUITouchState *touch)
{
	bt->botones->flecha_derecha->handler(bt, touch);
	bt->botones->flecha_izquierda->handler(bt, touch);
	bt->botones->home->handler(bt, touch);
}

void linkRequestHandler_menu(PedalElement **bt, GUITouchState *touch) //
{
	if(seleccion_menu==MENU_1)
	{
		for (uint8_t i = 0; i < 6; i++)
		{
			bt[i]->link->handler(bt[i], touch);
		}
	}
	else
	{
		for (uint8_t i = 6; i < 12; i++)
		{
			bt[i]->link->handler(bt[i], touch);
		}
	}
}

void linkRequestHandler_Flechas_Menu(LinkElementMenu *bt, GUITouchState *touch)
{
		bt->handler(bt, touch);
}

void PushRequestHandler_menu(PedalElement **bt, GUITouchState *touch)
{
	if(seleccion_menu==MENU_1)
	{
		for (uint8_t i = 0; i < 6; i++)
		{
			bt[i]->push->push_menu->handler(bt[i], touch);
		}
	}
	else
	{
		for (uint8_t i = 6; i < 12; i++)
		{
			bt[i]->push->push_menu->handler(bt[i], touch);
		}
	}
}

//Init / Redraw
LinkElement* initPushLink(uint8_t nombre,uint16_t x, uint16_t y,uint16_t width,uint16_t height, GUICallbackLink cb, LinkHandler han)
{
	LinkElement* e=calloc(1,sizeof(LinkElement));
		e->nombre=nombre;
		e->x=x;
		e->y=y;
		e->width=width;
		e->height=height;
		e->callback=cb;
		e->handler=han;
		return e;
}

LinkElementMenu* initPushLinkMenu(uint8_t nombre,uint16_t x, uint16_t y,uint16_t width,uint16_t height, GUICallbackLinkMenu cb, LinkHandlerMenu han)
{
	LinkElementMenu* e=calloc(1,sizeof(LinkElementMenu));
		e->nombre=nombre;
		e->x=x;
		e->y=y;
		e->width=width;
		e->height=height;
		e->callback=cb;
		e->handler=han;
		return e;
}

PerillaElement* initPerilla (uint8_t num)
{
	PerillaElement *gui = (PerillaElement *) calloc(1, sizeof(PerillaElement));
	gui->perillas = (GUIElement **) calloc(num, sizeof(GUIElement *));
	gui->numItems = num;
	return gui;
}

void PedalForceRedraw(PedalElement *gui) {
	for (uint8_t i = 0; i < gui->perilla->numItems; i++) {
		gui->perilla->perillas[i]->state |= GUI_DIRTY;
	}
	if(gui->push->push_state==GUI_ON)gui->push->push_state=GUI_DIRTY|GUI_HOVER|GUI_OFF;
}

void MenuForceRedraw(void)
{
	if (seleccion_menu==MENU_1)
	{
		for(int aux_i=0; aux_i<6; aux_i++)
		{
			if(Pedales[aux_i]->push->push_state==GUI_ON)Pedales[aux_i]->push->push_state=GUI_DIRTY|GUI_HOVER|GUI_OFF;
		}
	}
	else
	{
		for(int aux_i=6; aux_i<12; aux_i++)
		{
			if(Pedales[aux_i]->push->push_state==GUI_ON)Pedales[aux_i]->push->push_state=GUI_DIRTY|GUI_HOVER|GUI_OFF;
		}
	}
}
//

//Handles
void handlePushMenuButton(PedalElement *bt, GUITouchState *touch) {
	if (touch->touchDetected) {
		// touch detected...
		uint16_t x = touch->touchX[0];
		uint16_t y = touch->touchY[0];
		if (x >= bt->push->push_menu->x && x < bt->push->push_menu->x + bt->push->push_menu->width && y >= bt->push->push_menu->y && y < bt->push->push_menu->y + bt->push->push_menu->height) {
			switch (bt->push->push_state) {
			case GUI_OFF:
				bt->push->push_state |= GUI_HOVER | GUI_DIRTY;
				break;
			case GUI_ON:
				bt->push->push_state |= GUI_HOVER | GUI_DIRTY;
				break;
			default:
				break;
			}
		}
	} else if (bt->push->push_state & GUI_HOVER) {
		// clear hover flag
		bt->push->push_state &= ~((uint16_t) GUI_HOVER);
		// mark dirty (force redraw)
		bt->push->push_state |= GUI_DIRTY;
		// invert on/off bitmask
		bt->push->push_state ^= GUI_ONOFF_MASK;
		if (bt->push->push_menu->callback != NULL) {
			bt->push->push_menu->callback(bt);
		}
	}
}

