codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/SW4STM32/STM32746G_DISCOVERY/Example/User/gui.c
void handlePushIndividualButton(PedalElement *bt, GUITouchState *touch) {
	if (touch->touchDetected) {
		// touch detected...
		uint16_t x = touch->touchX[0];
		uint16_t y = touch->touchY[0];
		if (x >= bt->push->push_indiv->x && x < bt->push->push_indiv->x + bt->push->push_indiv->width && y >= bt->push->push_indiv->y && y < bt->push->push_indiv->y + bt->push->push_indiv->height) {
			switch (bt->push->push_state) {
			case GUI_OFF:
				bt->push->push_state |= GUI_HOVER | GUI_DIRTY;
				break;
			case GUI_ON:
				bt->push->push_state |= GUI_HOVER | GUI_DIRTY;
				break;
			default:
				break;
			}
		}
	} else if (bt->push->push_state & GUI_HOVER) {
		// clear hover flag
		bt->push->push_state &= ~((uint16_t) GUI_HOVER);
		// mark dirty (force redraw)
		bt->push->push_state |= GUI_DIRTY;
		// invert on/off bitmask
		bt->push->push_state ^= GUI_ONOFF_MASK;
		if (bt->push->push_indiv->callback != NULL) {
			bt->push->push_indiv->callback(bt);
		}
	}
}

void handleLinkButton(PedalElement *bt, GUITouchState *touch)
{
	if (touch->touchDetected)
	{
		// touch detected...
			uint16_t x = touch->touchX[0];
			uint16_t y = touch->touchY[0];
			if (x >= bt->link->x && x < bt->link->x + bt->link->width && y >= bt->link->y && y < bt->link->y + bt->link->height)
			{
				bt->link->callback(bt);
			}
	}
}

void handleDerechaButtonPedal(PedalElement *bt, GUITouchState *touch)
{
	if (touch->touchDetected)
	{
		// touch detected...
			uint16_t x = touch->touchX[0];
			uint16_t y = touch->touchY[0];
			if (x >= bt->botones->flecha_derecha->x && x < bt->botones->flecha_derecha->x + bt->botones->flecha_derecha->width && y >= bt->botones->flecha_derecha->y && y < bt->botones->flecha_derecha->y + bt->botones->flecha_derecha->height)
			{
				bt->botones->flecha_derecha->callback(bt);
			}
	}
}

void handleIzquierdaButtonPedal(PedalElement *bt, GUITouchState *touch)
{
	if (touch->touchDetected)
	{
		// touch detected...
			uint16_t x = touch->touchX[0];
			uint16_t y = touch->touchY[0];
			if (x >= bt->botones->flecha_izquierda->x && x < bt->botones->flecha_izquierda->x + bt->botones->flecha_izquierda->width && y >= bt->botones->flecha_izquierda->y && y < bt->botones->flecha_izquierda->y + bt->botones->flecha_izquierda->height)
			{
				bt->botones->flecha_izquierda->callback(bt);
			}
	}
}

void handleHomeButtonPedal(PedalElement *bt, GUITouchState *touch)
{
	if (touch->touchDetected)
	{
		// touch detected...
			uint16_t x = touch->touchX[0];
			uint16_t y = touch->touchY[0];
			if (x >= bt->botones->home->x && x < bt->botones->home->x + bt->botones->home->width && y >= bt->botones->home->y && y < bt->botones->home->y + bt->botones->home->height)
			{
				bt->botones->home->callback(bt);
			}
	}
}
//
//Menu Link Izq y Der
void handleDerechaButtonMenu(LinkElementMenu *bt, GUITouchState *touch)
{
	if (touch->touchDetected)
	{
		// touch detected...
			uint16_t x = touch->touchX[0];
			uint16_t y = touch->touchY[0];
			if (x >= bt->x && x < bt->x + bt->width && y >= bt->y && y < bt->y + bt->height)
			{
				bt->callback(bt);
			}
	}
}

void handleIzquierdaButtonMenu(LinkElementMenu *bt, GUITouchState *touch)
{
	if (touch->touchDetected)
	{
		// touch detected...
			uint16_t x = touch->touchX[0];
			uint16_t y = touch->touchY[0];
			if (x >= bt->x && x < bt->x + bt->width && y >= bt->y && y < bt->y + bt->height)
			{
				bt->callback(bt);
			}
	}
}

//Callbacks
void LinkCallback(PedalElement *e)
{
	switch(e->link->nombre)
	{
		case DELAY:
			DrawScreen(DELAY);
			pedal_individual=1;
			seleccion_pedal=DELAY;
		break;
	    case OCTAVADOR:
		    DrawScreen(OCTAVADOR);
			pedal_individual=1;
			seleccion_pedal=OCTAVADOR;
	    break;
	    case CHORUS:
		    DrawScreen(CHORUS);
			pedal_individual=1;
			seleccion_pedal=CHORUS;
	    break;
	    case PHASER:
	    	DrawScreen(PHASER);
	    	seleccion_pedal=PHASER;
			pedal_individual=1;
	    break;
	    case WHA:
		    DrawScreen(WHA);
			pedal_individual=1;
			seleccion_pedal=WHA;
	    break;
	    case REVERB:
		    DrawScreen(REVERB);
			pedal_individual=1;
			seleccion_pedal=REVERB;
	    break;
	    case DISTORSION:
			DrawScreen(DISTORSION);
			pedal_individual=1;
			seleccion_pedal=DISTORSION;
		break;
		case FLANGER:
			DrawScreen(FLANGER);
			pedal_individual=1;
			seleccion_pedal=FLANGER;
		break;
		case TREMOLO:
			DrawScreen(TREMOLO);
			pedal_individual=1;
			seleccion_pedal=TREMOLO;
		break;
		case VIBRATO:
			DrawScreen(VIBRATO);
			seleccion_pedal=VIBRATO;
			pedal_individual=1;
		break;
		case EQ:
			DrawScreen(EQ);
			pedal_individual=1;
			seleccion_pedal=EQ;
		break;
		case RINGMOD:
			DrawScreen(RINGMOD);
			pedal_individual=1;
			seleccion_pedal=RINGMOD;
		break;

	}
	PedalForceRedraw(e);

}

void PushCallback(PedalElement *e)
{

	if (e->push->push_state & (GUI_DIRTY|GUI_HOVER))
	{
			uint8_t states = e->push->push_state & GUI_ONOFF_MASK;
			if (pedal_individual==0)
			{
				if(states == GUI_ON)
				{
					switch(e->push->push_menu->nombre)
					{
						case DELAY:
							drawBitmapRaw(85,96,5,5, (uint8_t*)ledprendidodelaymenu, CM_ARGB8888, 1);
							break;
						case OCTAVADOR:
							drawBitmapRaw(237,78,6,6, (uint8_t*)ledprendidooctavadormenu, CM_ARGB8888, 1);
							break;
						case CHORUS:
							drawBitmapRaw(375,18,3,3, (uint8_t*)ledprendidochorusmenu, CM_ARGB8888, 1);
							break;
						case PHASER:
							drawBitmapRaw(103,210,5,6, (uint8_t*)ledprendidophasermenu, CM_ARGB8888, 1);
							break;
						case WHA:
							drawBitmapRaw(236,209,8,7, (uint8_t*)ledprendidowahmenu, CM_ARGB8888, 1);
							break;
						case REVERB:
							drawBitmapRaw(375,211,5,5, (uint8_t*)ledprendidoreverbmenu, CM_ARGB8888, 1);
							break;
						case DISTORSION:
							drawBitmapRaw(80,95,5,5, (uint8_t*)ledprendidodistorsionmenu, CM_ARGB8888, 1);
							break;
						case FLANGER:
							drawBitmapRaw(237,65,6,6, (uint8_t*)ledprendidoflangermenu, CM_ARGB8888, 1);
							break;
						case TREMOLO:
							drawBitmapRaw(390,22,8,8, (uint8_t*)ledprendidotremolomenu, CM_ARGB8888, 1);
							break;
						case VIBRATO:
							drawBitmapRaw(80,232,5,5, (uint8_t*)ledprendidovibratomenu, CM_ARGB8888, 1);
							break;
//						case EQ:
//							drawBitmapRaw(236,209,8,7, (uint8_t*)ledprendidowahmenu, CM_ARGB8888, 1);
//							break;
						case RINGMOD:
							drawBitmapRaw(373,241,6,6, (uint8_t*)ledprendidoringmodmenu, CM_ARGB8888, 1);
							break;
}
				}
				else
				{
					switch(e->push->push_menu->nombre)
					{
 	 	 	 			case DELAY:
 	 	 	 				drawBitmapRaw(85,96,5,5, (uint8_t*)ledapagadodelaymenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case OCTAVADOR:
 	 	 	 				drawBitmapRaw(237,78,6,6, (uint8_t*)ledapagadooctavadormenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case CHORUS:
 	 	 	 				drawBitmapRaw(375,18,3,3, (uint8_t*)ledapagadochorusmenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case PHASER:
 	 	 	 				drawBitmapRaw(103,210,5,6, (uint8_t*)ledapagadophasermenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case WHA:
 	 	 	 				drawBitmapRaw(236,209,8,7, (uint8_t*)ledapagadowahmenu, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case REVERB:
 	 	 	 				drawBitmapRaw(375,211,5,5, (uint8_t*)ledapagadoreverbmenu, CM_ARGB8888, 1);
 	 	 	 				break;
						case DISTORSION:
							drawBitmapRaw(80,95,5,5, (uint8_t*)ledapagadodistorsionmenu, CM_ARGB8888, 1);
							break;
						case FLANGER:
							drawBitmapRaw(237,65,6,6, (uint8_t*)ledapagadoflangermenu, CM_ARGB8888, 1);
							break;
						case TREMOLO:
							drawBitmapRaw(390,22,8,8, (uint8_t*)ledapagadotremolomenu, CM_ARGB8888, 1);
							break;
						case VIBRATO:
							drawBitmapRaw(80,232,5,5, (uint8_t*)ledapagadovibratomenu, CM_ARGB8888, 1);
							break;
//						case EQ:
//							drawBitmapRaw(236,209,8,7, (uint8_t*)ledapagadowahmenu, CM_ARGB8888, 1);
//							break;
						case RINGMOD:
							drawBitmapRaw(373,241,6,6, (uint8_t*)ledapagadoringmodmenu, CM_ARGB8888, 1);
							break;

