codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/SW4STM32/STM32746G_DISCOVERY/Example/User/gui.c
					}
				}
				// clear dirty flag
			e->push->push_state &= ~((uint16_t) GUI_DIRTY);
			}
			else
			{
				if(states == GUI_ON)
				{
					switch(e->push->push_indiv->nombre)
					{
						case DELAY:

							drawBitmapRaw(196,200,10,9, (uint8_t*)ledprendidodelaypedal, CM_ARGB8888, 1);
							break;
						case OCTAVADOR:
							drawBitmapRaw(233,159,15,16, (uint8_t*)ledprendidooctavadorpedal, CM_ARGB8888, 1);
							break;
						case CHORUS:
							drawBitmapRaw(236,23,7,6, (uint8_t*)ledprendidochoruspedal, CM_ARGB8888, 1);
							break;
						case PHASER:
							drawBitmapRaw(235,150,12,12, (uint8_t*)ledprendidophaserpedal, CM_ARGB8888, 1);
							break;
						case WHA:
							drawBitmapRaw(230,148,19,18, (uint8_t*)ledprendidowahpedal, CM_ARGB8888, 1);
							break;
						case REVERB:
							drawBitmapRaw(236,151,13,13, (uint8_t*)ledprendidoreverbpedal, CM_ARGB8888, 1);
							break;
						case DISTORSION:
							drawBitmapRaw(198,198,9,9, (uint8_t*)ledprendidodistorsionpedal, CM_ARGB8888, 1);
							break;
						case FLANGER:
							drawBitmapRaw(234,130,13,13, (uint8_t*)ledprendidoflangerpedal, CM_ARGB8888, 1);
							break;
						case TREMOLO:
							drawBitmapRaw(228,29,23,24, (uint8_t*)ledprendidotremolopedal, CM_ARGB8888, 1);
							break;
						case VIBRATO:
							drawBitmapRaw(196,200,11,10, (uint8_t*)ledprendidovibratopedal, CM_ARGB8888, 1);
							break;
	//						case EQ:
	//							drawBitmapRaw(236,209,8,7, (uint8_t*)ledprendidowahpedal, CM_ARGB8888, 1);
	//							break;
						case RINGMOD:
							drawBitmapRaw(195,222,10,10, (uint8_t*)ledprendidoringmodpedal, CM_ARGB8888, 1);
					}
				}
				else
				{
					switch(e->push->push_indiv->nombre)
					{
 	 	 	 			case DELAY:
 	 	 	 				drawBitmapRaw(196,200,10,9, (uint8_t*)ledapagadodelaypedal, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case OCTAVADOR:
 	 	 	 				drawBitmapRaw(233,159,15,16, (uint8_t*)ledapagadooctavadorpedal, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case CHORUS:
 	 	 	 				drawBitmapRaw(236,23,7,6, (uint8_t*)ledapagadochoruspedal, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case PHASER:
 	 	 	 				drawBitmapRaw(235,150,12,12, (uint8_t*)ledapagadophaserpedal, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case WHA:
 	 	 	 				drawBitmapRaw(230,148,19,18, (uint8_t*)ledapagadowahpedal, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case REVERB:
 	 	 	 				drawBitmapRaw(236,151,13,13, (uint8_t*)ledapagadoreverbpedal, CM_ARGB8888, 1);
 	 	 	 				break;
 	 	 	 			case DISTORSION:
							drawBitmapRaw(198,198,9,9, (uint8_t*)ledapagadodistorsionpedal, CM_ARGB8888, 1);
							break;
						case FLANGER:
							drawBitmapRaw(234,130,13,13, (uint8_t*)ledapagadoflangerpedal, CM_ARGB8888, 1);
							break;
						case TREMOLO:
							drawBitmapRaw(228,29,23,24, (uint8_t*)ledapagadotremolopedal, CM_ARGB8888, 1);
							break;
						case VIBRATO:
							drawBitmapRaw(196,200,11,10, (uint8_t*)ledapagadovibratopedal, CM_ARGB8888, 1);
							break;
	//						case EQ:
	//							drawBitmapRaw(236,209,8,7, (uint8_t*)ledapagadowahpedal, CM_ARGB8888, 1);
	//							break;
						case RINGMOD:
							drawBitmapRaw(195,222,10,10, (uint8_t*)ledapagadoringmodpedal, CM_ARGB8888, 1);
							break;
					}
				}
				// clear dirty flag
			e->push->push_state &= ~((uint16_t) GUI_DIRTY);
			}
	}
}

void LinkDerechaCallbackPedal(PedalElement *e)
{
	seleccion_pedal++;
	if(seleccion_pedal>=0 && seleccion_pedal<6)
	{
		seleccion_menu=MENU_1;
		DrawScreen(seleccion_pedal);
		PedalForceRedraw(Pedales[seleccion_pedal]);
	}
	else if (seleccion_pedal>=6 && seleccion_pedal<12)
	{
		seleccion_menu=MENU_2;
		DrawScreen(seleccion_pedal);
		PedalForceRedraw(Pedales[seleccion_pedal]);
	}
	else if(seleccion_pedal==12)
	{
		seleccion_menu=MENU_1;
		seleccion_pedal=0;
		DrawScreen(seleccion_pedal);
		PedalForceRedraw(Pedales[seleccion_pedal]);
	}
}

void LinkIzquierdaCallbackPedal(PedalElement *e)
{
	seleccion_pedal--;
	if(seleccion_pedal>=0 && seleccion_pedal<6)
	{
		seleccion_menu=MENU_1;
		DrawScreen(seleccion_pedal);
		PedalForceRedraw(Pedales[seleccion_pedal]);
	}
	else if (seleccion_pedal>=6 && seleccion_pedal<12)
	{
		seleccion_menu=MENU_2;
		DrawScreen(seleccion_pedal);
		PedalForceRedraw(Pedales[seleccion_pedal]);
	}
	else if(seleccion_pedal==-1)
	{
		seleccion_menu=MENU_2;
		seleccion_pedal=11;
		DrawScreen(seleccion_pedal);
		PedalForceRedraw(Pedales[seleccion_pedal]);
	}
}

void LinkHomeCallbackPedal(PedalElement *e)
{
	if(seleccion_menu==MENU_1)
	{
		pedal_individual=0;
		DrawScreen(MENU_1);
		MenuForceRedraw();
		seleccion_pedal=20;
	}
	else
	{
		pedal_individual=0;
		DrawScreen(MENU_2);
		MenuForceRedraw();
		seleccion_pedal=20;
	}
}

void LinkDerechaCallbackMenu(LinkElementMenu *e)
{
	seleccion_menu=MENU_2;
	DrawScreen(MENU_2);
	MenuForceRedraw();
}

void LinkIzquierdaCallbackMenu(LinkElementMenu *e)
{
    seleccion_menu=MENU_1;
	DrawScreen(MENU_1);
	MenuForceRedraw();
}

void initPedals() {
	//Inicializo las perillas Pantalla1
	//Delay
	Pedales[0]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[0]->perilla = initPerilla(3);
	Pedales[0]->perilla->perillas[0] = guiDialButton(0, "", 174, 36, 0.0f, 0.045f, PERILLA, &perilla5252, Delay_Feedback);
	Pedales[0]->perilla->perillas[1] = guiDialButton(1, "", 253, 36, 0.400f, 0.045f, PERILLA, &perilla5252,Delay_Time);
	Pedales[0]->perilla->perillas[2] = guiDialButton(2, "", 220, 82, 0.5f, 0.045f, PERILLA, &perilla4241,Delay_Level);
	//Octavador
	Pedales[1]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[1]->perilla = initPerilla(1);
	Pedales[1]->perilla->perillas[0] =guiDialButton(8, "", 0, 0, 0.0f, 0.045f, PERILLA, &perilla5252, NULL);;
	//Chorus
	Pedales[2]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[2]->perilla = initPerilla(2);
	Pedales[2]->perilla->perillas[0] = guiDialButton(0, "", 187, 22, 0.6f, 0.045f, PERILLA, &perilla4241, Distorsion_Gain);
	Pedales[2]->perilla->perillas[1] = guiDialButton(1, "", 250, 22, 0.367f, 0.045f, PERILLA, &perilla4241, Distorsion_Blend);
	//Phaser
	Pedales[3]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[3]->perilla = initPerilla(1);
	Pedales[3]->perilla->perillas[0] = guiDialButton(0, "", 214, 27, 0.667f, 0.045f, PERILLA, &perilla5252, Phaser_Rate);
	//Autowah
	Pedales[4]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[4]->perilla = initPerilla(4);
	Pedales[4]->perilla->perillas[0] = guiDialButton(0, "", 119, 41, 0.43f, 0.045f, PERILLA, &perilla4241, Autowah_Depth);
	Pedales[4]->perilla->perillas[1] = guiDialButton(1, "", 186, 41, 0.33f, 0.045f, PERILLA, &perilla4241,Autowah_Rate);
	Pedales[4]->perilla->perillas[2] = guiDialButton(2, "", 251, 41, 0.6f, 0.045f, PERILLA, &perilla4241,Autowah_Volume);
	Pedales[4]->perilla->perillas[3] = guiDialButton(3, "", 319, 41, 0.9f, 0.045f, PERILLA, &whaonda,Autowah_Mod);
	//Reverb
	Pedales[5]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[5]->perilla = initPerilla(2);
	Pedales[5]->perilla->perillas[0] = guiDialButton(0, "", 191, 47, 0.5f, 0.045f, PERILLA, &perilla4241, Reverb_Decay);
	Pedales[5]->perilla->perillas[1] = guiDialButton(1, "", 253, 47, 0.4f, 0.045f, PERILLA, &perilla4241, Reverb_Mix);

