codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/SW4STM32/STM32746G_DISCOVERY/Example/User/gui.c
	//Inicializo las perillas Pantalla2
	//Distorsion
	Pedales[6]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[6]->perilla = initPerilla(2);
	Pedales[6]->perilla->perillas[0] = guiDialButton(0, "", 179, 26, 0.0f, 0.045f, PERILLA, &perilla5252, Distorsion_Blend);
	Pedales[6]->perilla->perillas[1] = guiDialButton(1, "", 249, 26, 0.0f, 0.045f, PERILLA, &perilla5252, Distorsion_Gain);
	//Falnger
	Pedales[7]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[7]->perilla = initPerilla(4);
	Pedales[7]->perilla->perillas[0] =guiDialButton(0, "", 116, 55, 0.0f, 0.045f, PERILLA, &perilla5252, NULL);
	Pedales[7]->perilla->perillas[1] =guiDialButton(1, "", 182, 55, 0.0f, 0.045f, PERILLA, &perilla5252, NULL);
	Pedales[7]->perilla->perillas[2] =guiDialButton(2, "", 246, 55, 0.0f, 0.045f, PERILLA, &perilla5252, NULL);
	Pedales[7]->perilla->perillas[3] =guiDialButton(3, "", 311, 55, 0.0f, 0.045f, PERILLA, &perilla5252, NULL);
	//Tremolo
	Pedales[8]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[8]->perilla = initPerilla(3);
	Pedales[8]->perilla->perillas[0] = guiDialButton(0, "", 167, 40, 0.6f, 0.045f, PERILLA, &perilla4241, Tremolo_Depth);
	Pedales[8]->perilla->perillas[1] = guiDialButton(1, "", 220, 66, 0.6f, 0.045f, PERILLA, &perilla4241, Tremolo_Mod);
	Pedales[8]->perilla->perillas[2] = guiDialButton(2, "", 269, 40, 0.6f, 0.045f, PERILLA, &perilla4241, Tremolo_Rate);
	//Vibrato
	Pedales[9]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[9]->perilla = initPerilla(3);
	Pedales[9]->perilla->perillas[0] = guiDialButton(0, "", 180, 43, 0.667f, 0.045f, PERILLA, &perilla4241, Vibrato_Rate);
	Pedales[9]->perilla->perillas[1] = guiDialButton(1, "", 257, 43, 0.667f, 0.045f, PERILLA, &perilla4241, Vibrato_Depth);
	Pedales[9]->perilla->perillas[2] = guiDialButton(2, "", 223, 86, 0.667f, 0.045f, PERILLA, &perilla3535, Vibrato_Mod);
	//EQ
	Pedales[10]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[10]->perilla = initPerilla(6);
	Pedales[10]->perilla->perillas[0] = guiDialButton(0, "", 111, 97, 0.43f, 0.045f, SLIDER, &Spritesheet13_slider, EQ_Gain_0);
	Pedales[10]->perilla->perillas[1] = guiDialButton(1, "", 156, 97, 0.43f, 0.045f, SLIDER, &Spritesheet13_slider, EQ_Gain_1);
	Pedales[10]->perilla->perillas[2] = guiDialButton(2, "", 201, 97, 0.43f, 0.045f, SLIDER, &Spritesheet13_slider, EQ_Gain_2);
	Pedales[10]->perilla->perillas[3] = guiDialButton(3, "", 246, 97, 0.43f, 0.045f, SLIDER, &Spritesheet13_slider, EQ_Gain_3);
	Pedales[10]->perilla->perillas[4] = guiDialButton(4, "", 291, 97, 0.43f, 0.045f, SLIDER, &Spritesheet13_slider, EQ_Gain_4);
	Pedales[10]->perilla->perillas[5] = guiDialButton(5, "", 336, 97, 0.43f, 0.045f, SLIDER, &Spritesheet13_slider, EQ_Gain_5);
	//Ringmod
	Pedales[11]=(PedalElement*)calloc(1, sizeof(PedalElement));
	Pedales[11]->perilla = initPerilla(1);
	Pedales[11]->perilla->perillas[0] = guiDialButton(0, "", 223, 73, 0.5f, 0.045f, PERILLA, &perilla3535, Ringmod_Rate);

	//Inicializo los Push (3pdt) Pantalla 1
	//PEDALES Menu
	Pedales[0]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[0]->push->push_menu=initPushLink(DELAY,76,13+110/2,58,110/2,PushCallback, handlePushMenuButton);

	Pedales[1]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[1]->push->push_menu=initPushLink(OCTAVADOR,198,13+110/2,84,110/2,PushCallback, handlePushMenuButton);

	Pedales[2]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[2]->push->push_menu=initPushLink(CHORUS,346,13+110/2,61,110/2,PushCallback, handlePushMenuButton);

	Pedales[3]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[3]->push->push_menu=initPushLink(PHASER,73,149+110/2,64,110/2,PushCallback, handlePushMenuButton);

	Pedales[4]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[4]->push->push_menu=initPushLink(WHA,190,160+88/2,100,88/2,PushCallback, handlePushMenuButton);

	Pedales[5]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[5]->push->push_menu=initPushLink(REVERB,343,149+110/2,67,110/2,PushCallback, handlePushMenuButton);

	//Inicializo los Push (3pdt) Pantalla2
	//PEDALES Menu
	Pedales[6]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[6]->push->push_menu=initPushLink(DISTORSION,70,13+110/2,59,110/2,PushCallback, handlePushMenuButton);

	Pedales[7]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[7]->push->push_menu=initPushLink(FLANGER,179,23+90/2,121,90/2,PushCallback, handlePushMenuButton);

	Pedales[8]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[8]->push->push_menu=initPushLink(TREMOLO,354,13+110/2,80,110/2,PushCallback, handlePushMenuButton);

	Pedales[9]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[9]->push->push_menu=initPushLink(VIBRATO,71,149+110/2,57,110/2,PushCallback, handlePushMenuButton);

	Pedales[10]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[10]->push->push_menu=initPushLink(EQ,181,159+90/2,118,90/2,PushCallback, handlePushMenuButton);

	Pedales[11]->push=(PushElement*)calloc(1, sizeof(PushElement));
	Pedales[11]->push->push_menu=initPushLink(RINGMOD,360,149+110/2,68,110/2,PushCallback, handlePushMenuButton);

	//PEDALES Individuales Pantalla1
	Pedales[0]->push->push_indiv=initPushLink(DELAY,225,189,31,33,PushCallback, handlePushIndividualButton);
	Pedales[1]->push->push_indiv=initPushLink(OCTAVADOR,219,180,42,42,PushCallback, handlePushIndividualButton);
	Pedales[2]->push->push_indiv=initPushLink(CHORUS,180,163,117,77,PushCallback, handlePushIndividualButton);
	Pedales[3]->push->push_indiv=initPushLink(PHASER,222,171,37,37,PushCallback, handlePushIndividualButton);
	Pedales[4]->push->push_indiv=initPushLink(WHA,218,213,41,41,PushCallback, handlePushIndividualButton);
	Pedales[5]->push->push_indiv=initPushLink(REVERB,180,163,117,77,PushCallback, handlePushIndividualButton);

	//PEDALES Individuales Pantalla2
	Pedales[6]->push->push_indiv=initPushLink(DISTORSION,223,184,35,35,PushCallback, handlePushIndividualButton);
	Pedales[7]->push->push_indiv=initPushLink(FLANGER,223,168,37,37,PushCallback, handlePushIndividualButton);
	Pedales[8]->push->push_indiv=initPushLink(TREMOLO,222,203,36,36,PushCallback, handlePushIndividualButton);
	Pedales[9]->push->push_indiv=initPushLink(VIBRATO,221,188,37,37,PushCallback, handlePushIndividualButton);
	Pedales[10]->push->push_indiv=initPushLink(EQ,218,186,37,41,PushCallback, handlePushIndividualButton);
	Pedales[11]->push->push_indiv=initPushLink(RINGMOD,223,210,35,34,PushCallback, handlePushIndividualButton);
	//PEDALES estados
	Pedales[0]->push->push_state=GUI_OFF;
	Pedales[1]->push->push_state=GUI_OFF;
	Pedales[2]->push->push_state=GUI_OFF;
	Pedales[3]->push->push_state=GUI_OFF;
	Pedales[4]->push->push_state=GUI_OFF;
	Pedales[5]->push->push_state=GUI_OFF;
	Pedales[6]->push->push_state=GUI_OFF;
	Pedales[7]->push->push_state=GUI_OFF;
	Pedales[8]->push->push_state=GUI_OFF;
	Pedales[9]->push->push_state=GUI_OFF;
	Pedales[10]->push->push_state=GUI_OFF;
	Pedales[11]->push->push_state=GUI_OFF;
	//

	//Inicializo los links de los pedales Pantalla1
	Pedales[0]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
	Pedales[0]->link=initPushLink(DELAY,76,13,58,110/2,LinkCallback, handleLinkButton);

	Pedales[1]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
	Pedales[1]->link=initPushLink(OCTAVADOR,198,13,84,110/2,LinkCallback, handleLinkButton);

	Pedales[2]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
	Pedales[2]->link=initPushLink(CHORUS,346,13,61,110/2,LinkCallback, handleLinkButton);

