codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/SW4STM32/STM32746G_DISCOVERY/Example/User/gui.c
	Pedales[3]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
	Pedales[3]->link=initPushLink(PHASER,73,149,64,110/2,LinkCallback, handleLinkButton);

	Pedales[4]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
	Pedales[4]->link=initPushLink(WHA,190,160,100,88/2,LinkCallback, handleLinkButton);

	Pedales[5]->link=(LinkElement*)calloc(1,sizeof(LinkElement));
	Pedales[5]->link=initPushLink(REVERB,343,149,67,110/2,LinkCallback, handleLinkButton);

	//Inicializo los links de los pedales Pantalla2
	Pedales[6]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
	Pedales[6]->link=initPushLink(DISTORSION,70,13,59,110/2,LinkCallback, handleLinkButton);

	Pedales[7]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
	Pedales[7]->link=initPushLink(FLANGER,179,23,121,90/2,LinkCallback, handleLinkButton);

	Pedales[8]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
	Pedales[8]->link=initPushLink(TREMOLO,354,13,80,110/2,LinkCallback, handleLinkButton);

	Pedales[9]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
	Pedales[9]->link=initPushLink(VIBRATO,71,149,57,110/2,LinkCallback, handleLinkButton);

	Pedales[10]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
	Pedales[10]->link=initPushLink(EQ,181,159,118,90/2,LinkCallback, handleLinkButton);

	Pedales[11]->link=(LinkElement*)calloc(1, sizeof(LinkElement));
	Pedales[11]->link=initPushLink(RINGMOD,360,149,68,110/2,LinkCallback, handleLinkButton);

	//

	//Inicializo los botones de las pantallas individuales de los pedales PANTALLA1
	Pedales[0]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[0]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[0]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[0]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[1]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[1]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[1]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[1]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[2]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[2]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[2]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[2]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[3]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[3]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[3]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[3]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[4]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[4]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[4]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[4]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[5]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[5]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[5]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[5]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);
	
	//Inicializo los botones de las pantallas individuales de los pedales PANTALLA2
	Pedales[6]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[6]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[6]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[6]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[7]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[7]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[7]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[7]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[8]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[8]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[8]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[8]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[9]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[9]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[9]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[9]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[10]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[10]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[10]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[10]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);

	Pedales[11]->botones=(MenuElement*)calloc(1, sizeof(MenuElement));
	Pedales[11]->botones->flecha_derecha=initPushLink(DERECHA,417,84,61,107,LinkDerechaCallbackPedal, handleDerechaButtonPedal);
	Pedales[11]->botones->flecha_izquierda=initPushLink(IZQUIERDA,0,84,61,107,LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
	Pedales[11]->botones->home=initPushLink(HOME,0,0,70,70,LinkHomeCallbackPedal, handleHomeButtonPedal);
//

	//Inicializo los pedales con sus funciones PANTALLA1
	Pedales[0]->efecto=delay;
	Pedales[1]->efecto=octavador;
	Pedales[2]->efecto=chorus;
	Pedales[3]->efecto=phaser;
	Pedales[4]->efecto=autowah;
	Pedales[5]->efecto=reverb;

	//Inicializo los pedales con sus funciones PANTALLA2
	Pedales[6]->efecto=distorsion;
	Pedales[7]->efecto=flanger;
	Pedales[8]->efecto=tremolo;
	Pedales[9]->efecto=vibrato;
	Pedales[10]->efecto=ecualizador;
	Pedales[11]->efecto=ringmod;


	//Link Menu Izq y Der

	Flecha_Menu_Izquierda=(LinkElementMenu*)calloc(1,sizeof(LinkElementMenu));
	Flecha_Menu_Izquierda=initPushLinkMenu(IZQUIERDA_MENU,5,101,39,70,LinkIzquierdaCallbackMenu, handleIzquierdaButtonMenu);
	Flecha_Menu_Derecha=(LinkElementMenu*)calloc(1,sizeof(LinkElementMenu));
	Flecha_Menu_Derecha=initPushLinkMenu(DERECHA_MENU,435,101,39,70,LinkDerechaCallbackMenu, handleDerechaButtonMenu);

}

//



